test/Tur-roundJet-23000/ML/0/Dkf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "constant";
    object      Dkf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
29400
(
0.393028
0.324864
0.464032
0.508137
0.362112
0.480239
0.371035
0.472675
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            calculated;
        value           uniform 0;
    }
    UPPER
    {
        type            calculated;
        value           uniform 0;
    }
    PLANE
    {
        type            calculated;
        value           uniform 0;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
