test/Tur-roundJet-23000/ML/0/Pw
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "20000";
    object      Pw;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
29400
(
1.281e+07
4.30088e+07
9.75465e+07
1.6308e+08
2.32956e+08
2.99881e+08
3.60816e+08
4.14514e+08
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            calculated;
        value           uniform 0;
    }
    UPPER
    {
        type            calculated;
        value           uniform 0;
    }
    PLANE
    {
        type            calculated;
        value           uniform 0;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
