test/Tur-roundJet-23000/ML/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "20000";
    object      turbulenceProperties:R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
29400
(
(0.00515463 3.77628e-21 -6.39852e-05 0.00515949 -1.1199e-20 0.0051598)
(0.00955572 -3.62077e-20 -0.000217047 0.00959193 -1.61925e-20 0.00957175)
(0.0164595 -1.55072e-19 -0.00056335 0.0165454 9.97816e-21 0.0164813)
(0.0242358 1.1628e-22 -0.00107353 0.0243652 -0 0.0242628)
(0.0322986 -1.58023e-18 -0.00171052 0.0324695 9.24808e-20 0.0323281)
(0.0397055 1.05193e-19 -0.00238601 0.0399116 5.791e-20 0.0397355)
(0.046216 3.14158e-19 -0.00304634 0.046452 8.04129e-20 0.0462448)
(0.0517711 -4.57024e-19 -0.00365746 0.0520323 6.43337e-20 0.0517976)
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            fixedValue;
        value           nonuniform List<symmTensor> 
30
(
(0.157633 -5.81202e-17 -0.0153488 0.157591 -1.11958e-16 0.159752)
(0.162648 -3.91876e-17 -0.0267309 0.162752 -6.77756e-15 0.164354)
(0.17125 7.98914e-17 -0.0443923 0.171556 -1.30814e-15 0.173047)
(0.18323 4.19902e-17 -0.0599608 0.183553 -1.96114e-15 0.184963)
(0.197237 -2.95625e-17 -0.0735137 0.197596 -3.23772e-15 0.198935)
(0.212997 -1.736e-17 -0.0864417 0.213424 -3.01622e-15 0.214663)
(0.22972 -1.69916e-17 -0.0983419 0.230189 -3.81898e-16 0.23133)
(0.246742 2.99741e-17 -0.109426 0.24731 -2.88044e-15 0.248686)
...
)
;
    }
    UPPER
    {
        type            fixedValue;
        value           nonuniform List<symmTensor> 
180
(
(7.86266e-09 2.95439e-25 -1.8893e-09 7.74859e-09 -1.24585e-25 4.38875e-09)
(8.06514e-09 1.99652e-25 -1.11858e-09 7.91431e-09 -1.88348e-26 4.02056e-09)
(7.99365e-09 3.16704e-25 -8.76861e-10 8.00345e-09 3.66801e-24 4.0029e-09)
(7.99416e-09 3.86249e-24 -8.15162e-10 8.01897e-09 5.24346e-25 3.98687e-09)
(8.0039e-09 1.45854e-24 -7.84806e-10 8.02425e-09 4.24472e-24 3.97185e-09)
(8.01281e-09 1.27583e-24 -7.55236e-10 8.02934e-09 2.38167e-24 3.95785e-09)
(8.02202e-09 -3.02175e-25 -7.26383e-10 8.0338e-09 -5.11362e-25 3.94417e-09)
(8.03068e-09 1.41233e-24 -7.00252e-10 8.0377e-09 3.47088e-24 3.93162e-09)
...
)
;
    }
    PLANE
    {
        type            fixedValue;
        value           uniform (6.66667e-11 0 -0 6.66667e-11 -0 6.66667e-11);
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0 0 0 0);
        value           nonuniform List<symmTensor> 
140
(
(4.43845e-05 -2.4737e-21 -1.18057e-07 4.43847e-05 -9.44995e-24 4.43844e-05)
(2.58154e-05 -3.78739e-22 -4.0582e-07 2.58174e-05 1.21464e-23 2.58151e-05)
(0.00014496 -1.17675e-20 -6.87872e-06 0.000145018 -2.83127e-23 0.000144952)
(0.000543269 -7.9462e-19 -5.50314e-05 0.000543941 7.46195e-21 0.000543193)
(0.00144678 5.00775e-18 -0.000252087 0.0014509 -1.99759e-20 0.00144638)
(0.00307059 1.02873e-17 -0.000783073 0.0030872 -1.9209e-21 0.00306924)
(0.0054733 -1.24555e-17 -0.00179232 0.00552262 -2.28957e-19 0.00547012)
(0.00845 -4.59398e-18 -0.00320647 0.0085658 -1.72169e-20 0.0084446)
...
)
;
    }
}


// ************************************************************************* //
