test/Tur-roundJet-23000/ML/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "20000";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
29400
(
312.981
313.15
313.286
313.351
313.422
313.582
313.588
313.639
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            inletOutlet;
        inletValue      uniform 298;
        value           uniform 298;
    }
    UPPER
    {
        type            fixedValue;
        value           uniform 298;
    }
    PLANE
    {
        type            fixedValue;
        value           uniform 318;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            inletOutlet;
        inletValue      uniform 298;
        value           nonuniform List<scalar> 
140
(
317.452
316.333
315.167
313.956
312.705
311.435
310.188
309.015
...
)
;
    }
}


// ************************************************************************* //
