test/Tur-roundJet-23000/ML/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "20000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
29400
(
(0.290236 3.8738e-17 -0.000640053)
(0.561463 5.05283e-17 -0.00273906)
(0.82044 3.25154e-18 -0.00158105)
(1.0343 1.91667e-18 -0.00158061)
(1.21769 -2.0889e-18 -0.0010878)
(1.36446 -4.06392e-17 -0.000794528)
(1.48131 -3.87633e-17 -0.000516996)
(1.57368 -3.88791e-17 -0.000292387)
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            surfaceNormalFixedValue;
        refValue        nonuniform List<scalar> 
30
(
-10.7346
-10.7015
-10.6446
-10.565
-10.4699
-10.3612
-10.2408
-10.1118
...
)
;
    }
    UPPER
    {
        type            fixedValue;
        value           uniform (0 0 -0.445);
    }
    PLANE
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
140
(
(0.0476555 4.13855e-18 5.20555e-06)
(0.144541 9.73436e-18 3.38641e-05)
(0.244939 -1.59866e-18 8.05101e-05)
(0.348664 -3.73751e-19 0.000146355)
(0.454925 -2.17625e-17 0.000226323)
(0.561666 -2.80518e-17 0.000315682)
(0.665196 -1.87532e-17 0.000407689)
(0.761073 -4.99659e-18 0.000492464)
...
)
;
    }
}


// ************************************************************************* //
