test/Tur-roundJet-23000/ML/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "20000";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
29400
(
1.56908e-08
2.91207e-08
5.01716e-08
7.38615e-08
9.84091e-08
1.20947e-07
1.40749e-07
1.5764e-07
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.00120859
0.00119189
0.00116286
0.00112501
0.00108451
0.00104203
0.000999098
0.000955355
...
)
;
    }
    UPPER
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
2.84822e-12
4.01427e-12
4.31169e-12
4.48728e-12
4.65977e-12
4.84094e-12
5.02923e-12
5.22555e-12
...
)
;
    }
    PLANE
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            calculated;
        value           nonuniform List<scalar> 
140
(
1.35049e-10
4.66465e-10
7.96076e-09
6.44909e-08
3.03343e-07
9.94058e-07
2.49825e-06
5.13546e-06
...
)
;
    }
}


// ************************************************************************* //
