test/Tur-roundJet-23000/ML/0/grad(T)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      grad(T);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   nonuniform List<vector> 
29400
(
(0 0 0)
(0 -0 0)
(0 -0 0)
(0.476515 2.32831e-10 -91231.1)
(59.2245 3.63798e-11 -90333.1)
(10.5633 1.44436e-11 -14712.3)
(11.041 -7.50935e-11 -23913.1)
(49.285 -7.27596e-11 -87390)
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    UPPER
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    PLANE
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
210
(
(0 0 -108545)
(0 0 -104890)
(0 0 -101949)
(0.476515 2.32831e-10 -100543)
(59.2245 3.63798e-11 -99007.9)
(10.5633 1.44436e-11 -95547.6)
(11.041 -7.50935e-11 -95417.8)
(49.285 -7.27596e-11 -94314.8)
...
)
;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
