test/Tur-roundJet-23000/ML/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "20000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
29400
(
0.00773696
0.0143597
0.0247431
0.0364319
0.0485481
0.0596763
0.0694564
0.0778005
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
30
(
0.237488
0.244877
0.257927
0.275873
0.296884
0.320542
0.34562
0.371369
...
)
;
    }
    UPPER
    {
        type            fixedValue;
        value           uniform 1e-08;
    }
    PLANE
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            inletOutlet;
        inletValue      uniform 1e-08;
        value           nonuniform List<scalar> 
140
(
6.65768e-05
3.87239e-05
0.000217465
0.000815202
0.00217203
0.00461352
0.00823302
0.0127302
...
)
;
    }
}


// ************************************************************************* //
