test/Tur-roundJet-23000/ML/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "20000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
29400
(
1.33387e-08
2.47543e-08
4.26478e-08
6.27848e-08
8.36512e-08
1.0281e-07
1.19643e-07
1.34001e-07
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.0010273
0.0010131
0.000988427
0.000956255
0.000921831
0.000885725
0.000849233
0.000812051
...
)
;
    }
    UPPER
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
2.42099e-12
3.41236e-12
3.66525e-12
3.81455e-12
3.96121e-12
4.11523e-12
4.27529e-12
4.44216e-12
...
)
;
    }
    PLANE
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            calculated;
        value           nonuniform List<scalar> 
140
(
1.14792e-10
3.96495e-10
6.76664e-09
5.48172e-08
2.57841e-07
8.44947e-07
2.12351e-06
4.36513e-06
...
)
;
    }
}


// ************************************************************************* //
