test/Tur-roundJet-23000/ML/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "20000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
29400
(
580037
580090
580173
580267
580363
580452
580530
580597
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
30
(
231.177
241.71
260.947
288.493
322.059
361.898
406.979
457.322
...
)
;
    }
    UPPER
    {
        type            fixedValue;
        value           uniform 1e-08;
    }
    PLANE
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
210
(
580037
580090
580173
580267
580363
580452
580530
580597
...
)
;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            inletOutlet;
        inletValue      uniform 1e-08;
        value           nonuniform List<scalar> 
140
(
579976
97665.5
32137.9
14871.3
8423.92
5460.13
3877.09
2916.34
...
)
;
    }
}


// ************************************************************************* //
