test/Tur-roundJet-23000/ML/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "20000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
29400
(
51.2064
50.601
48.9673
47.1958
45.2103
43.2122
41.272
39.4378
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.286979
0.279655
0.275
0.264388
0.253991
0.241926
0.227771
0.213541
...
)
;
    }
    UPPER
    {
        type            calculated;
        value           uniform 0;
    }
    PLANE
    {
        type            calculated;
        value           nonuniform List<scalar> 
210
(
51.2064
50.601
48.9673
47.1958
45.2103
43.2122
41.272
39.4378
...
)
;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
