test/Tur-roundJet-23000/ML/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "20000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
58450
(
5.58922e-09
-5.5894e-09
1.92693e-08
-1.36805e-08
3.70078e-08
-1.7739e-08
5.78187e-08
-2.08114e-08
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
        value           nonuniform List<scalar> 
4200
(
5.3721e-19
1.26348e-18
1.53199e-18
1.61041e-18
1.65273e-18
1.68786e-18
1.72245e-18
1.75715e-18
...
)
;
    }
    IN
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
-1.51598e-06
-4.0402e-06
-5.90219e-06
-7.21949e-06
-8.09807e-06
-8.62619e-06
-8.87822e-06
-8.91735e-06
...
)
;
    }
    UPPER
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
-2.22054e-07
-2.29604e-07
-2.35941e-07
-2.42386e-07
-2.48888e-07
-2.55484e-07
-2.62198e-07
-2.6905e-07
...
)
;
    }
    PLANE
    {
        type            calculated;
        value           uniform 0;
    }
    AXIS
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
    FRONT
    {
        type            wedge;
        value           nonuniform List<scalar> 
4200
(
5.37223e-19
1.26352e-18
1.53206e-18
1.6105e-18
1.65283e-18
1.68796e-18
1.72253e-18
1.75723e-18
...
)
;
    }
    FRONT2
    {
        type            wedge;
        value           nonuniform List<scalar> 
25200
(
1.40816e-17
-4.33528e-17
4.08809e-17
2.30812e-17
-5.89242e-17
5.57936e-17
-5.41485e-17
1.4924e-17
...
)
;
    }
    BACK2
    {
        type            wedge;
        value           nonuniform List<scalar> 
25200
(
1.40816e-17
-4.33528e-17
4.08809e-17
2.30812e-17
-5.89242e-17
5.57936e-17
-5.41485e-17
1.4924e-17
...
)
;
    }
    OUT
    {
        type            calculated;
        value           nonuniform List<scalar> 
140
(
1.53134e-07
4.84836e-07
8.56634e-07
1.27079e-06
1.72771e-06
2.22253e-06
2.74249e-06
3.2692e-06
...
)
;
    }
}


// ************************************************************************* //
