test/Tur-roundJet-23000/ML/constant/g
FoamFile
{
	version	2.0;
	class	uniformDimensionedVectorField;
	format	ascii;
	location	"constant";
	object	g;
}
dimensions	[0 1 -2 0 0 0 0];
value	(0.0 0.0 0.0);
