test/Tur-roundJet-23000/ML/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	   2.0;
    format	   ascii;
    class	   dictionary;
    location	  "system";
    object	   controlDict;
}
//    author      Huakun Huang
//    Email:      huanghuakun0902@163.com
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "paras2.H"

application             buoyantFoam;

startFrom               latestTime;

startTime               0;

stopAt                  endTime;

endTime                 10000;

deltaT                  1;

writeControl            timeStep;

writeInterval           500;

purgeWrite              0;

timeFormat              general;

timePrecision           6;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

runTimeModifiable        yes;

maxCo        1;

maxAlphaCo        0;

#include  "libDict"
functions
{
  //#includeFunc     residuals
  //#includeFunc     gradT
  //#includeFunc     lineCenter
  //#includeFunc     lineNu
  //#includeFunc     outlet
  //#includeFunc     linep
 // #includeFunc     lineT
 //#includeFunc cuttingPlate
 probes1
 {
     type         probes;
     libs         (sampling);
     probeLocations      ((0.04 0 0.016));
     fields       (U);
 }
}
// ************************************************************************* //
